### Conversion:
from fusion v2 EO.csv -> df_final_1.csv

This provides the right fields and id-codes to match the query.

These still need to be cut up to by district jsons

In [1]:
import json
import pandas as pd
import xml
import xml.etree.ElementTree as ET

In [2]:
df_org = pd.read_csv('../data/orgtbl3.csv')
df_fusion = pd.read_csv('../data/fusion v2 EO.csv')
df_districts = pd.read_csv('../data/senate_meta_v1.csv')

C:\Users\wsutt\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3058: DtypeWarning: Columns (30) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

#### Select only the columns we need

In [3]:
query_cols = 'Name, Latitude, Longitude, senateId, incomeAmount, mnnSectorCode, assetAmount'
query_cols

'Name, Latitude, Longitude, senateId, incomeAmount, mnnSectorCode, assetAmount'

In [4]:
df_final = df_fusion[['Name', 'Latitude', 'Longitude', 
                      'Income Amount', 'Asset Amount',  
                      'MNN Sector', 'Senate District']]

In [5]:
df_final.dtypes

Name                object
Latitude           float64
Longitude          float64
Income Amount      float64
Asset Amount       float64
MNN Sector          object
Senate District     object
dtype: object

#### Handle NA's

In [6]:
tmp = df_final['MNN Sector']
tmp[tmp.isna()] = "NA"
df_final['mnnSector'] = tmp

sum(df_final['mnnSector'].isna())

C:\Users\wsutt\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\wsutt\Anaconda3\lib\site-packages\pandas\core\generic.py:9114: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)
C:\Users\wsutt\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3326: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exec(code_obj, self.user_global_ns, self.user_ns)
C:\Users\wsutt\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

0

In [7]:
# sum(df_final['Senate District'].isna())
# df_final[df_final['Senate District'].isna()]

#### Build Join Tables
we need to join to get a sector id-code, and senate-district id-code

note: sector id-code proceeds DESC in total prevalence, with NA added in

In [7]:
df_districts = df_districts.sort_values(by='senateId')
df_districts_v2 = df_districts[['senateId', 'name']]
df_districts_v2.head(3)

    senateId            name
32         1   First Suffolk
29         2  Second Suffolk
21         3         Hampden

In [8]:
lookup_sector = pd.DataFrame(df_final['mnnSector'].value_counts())
lookup_sector['sectorName'] = lookup_sector.index
lookup_sector.reset_index(inplace=True, drop=True)
lookup_sector['mnnSectorCode'] = lookup_sector.index + 1
lookup_sector

    mnnSector               sectorName  mnnSectorCode
0        7160        Youth & Education              1
1        6114           Human Services              2
2        3315                    Other              3
3        3167           Arts & Culture              4
4        3089  Religious Organizations              5
5        2504             Philanthropy              6
6        2296                  Housing              7
7        2005      Health & Healthcare              8
8        1583                       NA              9
9        1385             Human Rights             10
10       1348     Environment & Nature             11

#### Perform Merges

In [9]:
df_final = pd.merge(df_final, 
         lookup_sector, 
         how='left', 
         left_on='MNN Sector',
         right_on='sectorName'
        )

In [10]:
df_final = pd.merge(df_final, 
         df_districts_v2, 
         how='left', 
         left_on='Senate District',
         right_on='name'
        )

#### SenateId Merge misses 4-5 districts, analyze + fix here

In [11]:
(sum(df_final['senateId'].isna()), 
 sum(df_final['Senate District'].isna()))

(4825, 29)

In [12]:
df_final['senateId2'] = df_final['senateId']
df_final['senateId2'] = df_final['senateId2'].fillna(-1)

In [13]:
df_final.groupby(['Senate District', 'senateId2']).agg('count')['Name']

Senate District             senateId2
Berkshire                   -1.0         1160
Bristol & Norfolk            31.0         650
Cape & Islands               40.0        1522
Fifth Middlesex              23.0         732
First Bristol & Plymouth     37.0         548
First Essex                  19.0         702
First Essex & Middlesex      20.0        1021
First Hampden & Hampshire    7.0          575
First Middlesex              13.0         548
First Middlesex & Norfolk    29.0        1396
First Plymouth & Bristol     36.0         588
First Suffolk                1.0         1005
First Suffolk & Middlesex    27.0        2197
First Worcester              10.0         925
Fourth Middlesex             24.0         778
Hampden                      3.0          540
Hampshire                   -1.0         1019
Middlesex & Suffolk          26.0        1021
Middlesex & Worcester        14.0        1122
Norfolk                     -1.0         1960
Norfolk & Plymouth           33.0         486
Norfolk & Suffolk            30.0         783
Plymouth & Barnstable        39.0         817
Plymouth & Norfolk           34.0         838
Second Bristol & Plymouth    38.0         525
Second Essex                 21.0         769
Second Essex & Middlesex     18.0         523
Second Hampden & Hampshire   5.0          791
Second Middlesex             25.0         763
Second Middlesex & Norfolk   15.0         754
Second Plymouth & Bristol    35.0         490
Second Suffolk               2.0          859
Second Suffolk & Middlesex   28.0        1152
Second Worcester             11.0         539
Third Essex                  22.0         678
Third Middlesex              16.0        1303
Worcester                   -1.0          657
Worcester & Middlesex        9.0          646
Worcester & Norfolk          12.0         555
Name: Name, dtype: int64

In [15]:
bads = ['Worcester', 'Norfolk' , 'Hampshire'  , 'Berkshire']

In [16]:
sum(df_final['Senate District'].isin(bads))

4796

In [17]:
import numpy as np
matches = [int(e) for e in df_final['senateId'].unique().tolist() 
 if not(np.isnan(e))]

In [18]:
bad_joins = [i for i in range(1,41) if i not in matches]
bad_joins

[4, 6, 8, 17, 32]

In [19]:
df_districts_v2.reset_index(inplace=True)

#### Fix bad join lookups here

In [20]:
df_districts_v2[df_districts_v2['senateId'].isin(bad_joins)]

    index  senateId                                         name
3      11         4   Berkshire & Hampshire & Franklin & Hampden
5       6         6             Hampshire & Franklin & Worcester
7       2         8  Worcester & Hampden & Hampshire & Middlesex
16      0        17                Norfolk & Bristol & Middlesex
31      1        32                 Norfolk & Bristol & Plymouth

In [21]:
df_districts_v2['name2'] = df_districts_v2['name']

C:\Users\wsutt\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [22]:
df_districts_v2.iloc[3,3] = 'Berkshire'
df_districts_v2.iloc[5,3] = 'Hampshire'
df_districts_v2.iloc[7,3] = 'Worcester'
df_districts_v2.iloc[16,3] = 'Norfolk'

C:\Users\wsutt\Anaconda3\lib\site-packages\pandas\core\indexing.py:494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [23]:
df_districts_v2[df_districts_v2['senateId'].isin(bad_joins)]

,index,senateId,name,name2
3,11,4,Berkshire & Hampshire & Franklin & Hampden,Berkshire
5,6,6,Hampshire & Franklin & Worcester,Hampshire
7,2,8,Worcester & Hampden & Hampshire & Middlesex,Worcester
16,0,17,Norfolk & Bristol & Middlesex,Norfolk
31,1,32,Norfolk & Bristol & Plymouth,Norfolk & Bristol & Plymouth

#### re-merge on new name2 lookup col

In [25]:
df_final.columns

Index(['Name', 'Latitude', 'Longitude', 'Income Amount', 'Asset Amount',
       'MNN Sector', 'Senate District', 'mnnSector_x', 'mnnSector_y',
       'sectorName', 'mnnSectorCode', 'senateId', 'name', 'senateId2'],
      dtype='object')

In [26]:
tmp = pd.merge(df_final, 
         df_districts_v2, 
         how='left', 
         left_on='Senate District',
         right_on='name2'
        )

In [37]:
(sum(tmp['Senate District'].isna()),
 sum(tmp['senateId_x'].isna()),
 sum(tmp['senateId_y'].isna())
)

(29, 4825, 29)

In [38]:
df_final = tmp.copy()

In [39]:
list(df_final.columns)

['Name',
 'Latitude',
 'Longitude',
 'Income Amount',
 'Asset Amount',
 'MNN Sector',
 'Senate District',
 'mnnSector_x',
 'mnnSector_y',
 'sectorName',
 'mnnSectorCode',
 'senateId_x',
 'name_x',
 'senateId2',
 'index',
 'senateId_y',
 'name_y',
 'name2']

#### Rename + Reorder Cols to Match Query

In [40]:
query_cols
cols = query_cols.split(', ')
cols

['Name',
 'Latitude',
 'Longitude',
 'senateId',
 'incomeAmount',
 'mnnSectorCode',
 'assetAmount']

In [41]:
df_final = df_final[['Name', 'Latitude', 'Longitude', 
                  'senateId_y','Income Amount', 'mnnSectorCode', 
                  'Asset Amount']]

In [42]:
df_final.columns = cols

#### Analyze

In [43]:
df_final.head(3)

,Name,Latitude,Longitude,senateId,incomeAmount,mnnSectorCode,assetAmount
0,04 FOUNDATION INC,42.583460,-70.776972,20.0,NaN,6,NaN
1,1000 FRIENDS OF MASSACHUSETTS INC,42.358245,-71.062141,27.0,0.0,11,0.0
2,100TH BOMB GROUP FOUNDATION INC,42.357350,-71.054848,27.0,45965.0,4,196429.0

In [50]:
df_final.dtypes

Name              object
Latitude         float64
Longitude        float64
senateId           int32
incomeAmount     float64
mnnSectorCode      int64
assetAmount      float64
dtype: object

In [51]:
df_final.fillna(-1, inplace=True)
df_final['senateId'] = df_final['senateId'].astype('int')

C:\Users\wsutt\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [52]:
df_final.dtypes

Name              object
Latitude         float64
Longitude        float64
senateId           int32
incomeAmount     float64
mnnSectorCode      int64
assetAmount      float64
dtype: object

#### Output the dataframe

In [53]:
df_final.to_csv('output/df_final_1.csv', index=False)

#### Scratch work

In [ ]:
orgDataTable.addColumn('number','Youth & Education');       //1
orgDataTable.addColumn('number','Human Services');  
orgDataTable.addColumn('number','Other');  
orgDataTable.addColumn('number','Arts & Culture');  
orgDataTable.addColumn('number','Religious Organizations');  //5
orgDataTable.addColumn('number','Philanthropy');  
orgDataTable.addColumn('number','Housing');  
orgDataTable.addColumn('number','Healthcare');  
orgDataTable.addColumn('number','NA');  
orgDataTable.addColumn('number','Human Rights');            //10
orgDataTable.addColumn('number','Environment & Nature');  
orgDataTable.addColumn('number','NAN');

In [23]:
len(df_fusion['MNN Sector'].value_counts())

10

In [21]:
query_col

'Name, Latitude, Longitude, senateId, incomeAmount, mnnSectorCode, assetAmount'

In [17]:
df_districts_v2

    senateId                                         name
32         1                                First Suffolk
29         2                               Second Suffolk
21         3                                      Hampden
11         4   Berkshire & Hampshire & Franklin & Hampden
9          5                   Second Hampden & Hampshire
6          6             Hampshire & Franklin & Worcester
8          7                    First Hampden & Hampshire
2          8  Worcester & Hampden & Hampshire & Middlesex
22         9                        Worcester & Middlesex
24        10                              First Worcester
18        11                             Second Worcester
14        12                          Worcester & Norfolk
34        13                              First Middlesex
10        14                        Middlesex & Worcester
17        15                   Second Middlesex & Norfolk
7         16                              Third Middlesex
0         17                Norfolk & Bristol & Middlesex
33        18                     Second Essex & Middlesex
19        19                                  First Essex
5         20                      First Essex & Middlesex
23        21                                 Second Essex
31        22                                  Third Essex
37        23                              Fifth Middlesex
28        24                             Fourth Middlesex
36        25                             Second Middlesex
30        26                          Middlesex & Suffolk
35        27                    First Suffolk & Middlesex
26        28                   Second Suffolk & Middlesex
16        29                    First Middlesex & Norfolk
3         30                            Norfolk & Suffolk
4         31                            Bristol & Norfolk
1         32                 Norfolk & Bristol & Plymouth
27        33                           Norfolk & Plymouth
38        34                           Plymouth & Norfolk
20        35                    Second Plymouth & Bristol
15        36                     First Plymouth & Bristol
13        37                     First Bristol & Plymouth
39        38                    Second Bristol & Plymouth
12        39                        Plymouth & Barnstable
25        40                               Cape & Islands

In [5]:
df_fusion

,X,EIN,Name,Latitude,Longitude,Address,City,State,Zip Code,Classification,...,County,House District,Senate District,Congressional District,Years Exempt,Designation 501c,Affiliation Type,School,Org Type,MNN Status
0,1.0,454469512.0,04 FOUNDATION INC,42.583460,-70.776972,93 PLEASANT ST,MANCHESTER,MA,01944-1107,Charitable Organization,...,ESSEX,4th Essex,First Essex & Middlesex,6.0,1.249315,3,Indepedent,Priv.Op.Found.Other,Corporation,False
1,2.0,222988006.0,1000 FRIENDS OF MASSACHUSETTS INC,42.358245,-71.062141,14 BEACON STREET,BOSTON,MA,02108-3704,Charitable Organization,...,SUFFOLK,3rd Suffolk,First Suffolk & Middlesex,8.0,18.761644,3,Indepedent,Priv.Op.Found.Other,Corporation,False
2,3.0,930917084.0,100TH BOMB GROUP FOUNDATION INC,42.357350,-71.054848,2 OLIVER ST,BOSTON,MA,02109-4901,Charitable Organization,...,SUFFOLK,3rd Suffolk,First Suffolk & Middlesex,8.0,26.019178,3,Indepedent,Priv.Op.Found.Other,Corporation,False
3,4.0,42680019.0,101ST INFANTRY VETERANS ASSOCIATION INC,42.297001,-71.051882,70 VICTORY RD,BOSTON,MA,02122-2628,Post or Organization of War Veterans,...,SUFFOLK,13th Suffolk,First Suffolk,8.0,0.410845,19,Indepedent,Priv.Op.Found.Other,Corporation,False
4,5.0,42769496.0,104TH US INFANTRY VETERANS AEF ASSOCIATION INC,42.193138,-72.628099,8 COOK ST,HOLYOKE,MA,01040-3508,Post or Organization of War Veterans,...,HAMPDEN,5th Hampden,Second Hampden & Hampshire,1.0,30.432763,19,Indepedent,Priv.Op.Found.Other,Corporation,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
33961,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN
33962,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN
33963,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN
33964,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN
33965,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN

In [ ]:
tblname,name,poly,incomeShared,senateIdShared

In [2]:
query_col = 'Name, Latitude, Longitude, senateId, incomeAmount, mnnSectorCode, assetAmount'